Repository: Metanome/mic-controlx
Catalog: src/Resources/Strings.*.resx
Languages: de, tr

source: Settings
de: Einstellungen
tr: Ayarlar

source: About
de: Über
tr: Hakkında

source: Global Hotkey
de: Globale Tastenkombination
tr: Genel Kısayol

# HotkeyInstruction
source: Press F11 to toggle, hold to mute/unmute temporarily
de: F11 zum Umschalten drücken, gedrückt halten für vorübergehende Stummschaltung
tr: Geçiş için F11’e basın, basılı tutarak geçici olarak sessize alın/açın

# HotkeyInstructionTemplate
source: Press {0} to toggle, hold to mute/unmute temporarily
de: {0} zum Umschalten drücken, gedrückt halten für vorübergehende Stummschaltung
tr: Geçiş için {0} tuşuna basın, basılı tutarak geçici olarak sessize alın/açın

source: Features & Compatibility
de: Funktionen & Kompatibilität
tr: Özellikler & Uyumluluk

# FeatureUniversal
source: • Universal Windows microphone control utility
de: • Universelles Windows Mikrofon-Steuerungsprogramm
tr: • Evrensel Windows mikrofon kontrol aracı

# FeatureAnyDevice
source: • Works with any Windows audio device and system settings
de: • Funktioniert mit jedem Windows-Audiogerät und Systemeinstellungen
tr: • Herhangi bir Windows ses aygıtı ve sistem ayarlarıyla çalışır

source: Alternative Controls
de: Weitere Bedienoptionen
tr: Alternatif Kontroller

# ControlSingleClick
source: • Single-click system tray icon to toggle
de: • Einzelklick auf Infobereich-Symbol zum Umschalten
tr: • Geçiş için sistem tepsisi simgesine tek tık

# ControlDoubleClick
source: • Double-click tray icon to open app
de: • Doppelklick auf Symbol zum Öffnen der App
tr: • Uygulamayı açmak için simgeye çift tık

# ControlRightClick
source: • Right-click tray icon for options
de: • Rechtsklick auf Symbol für Optionen
tr: • Seçenekler için simgeye sağ tık

source: Microphone Status
de: Mikrofonstatus
tr: Mikrofon Durumu

source: Microphone
de: Mikrofon
tr: Mikrofon

source: Active
de: Aktiv
tr: Aktif

source: Muted
de: Stumm
tr: Sessiz

source: System Information
de: Systeminformationen
tr: Sistem Bilgisi

source: Brand:
de: Marke:
tr: Marka:

# MicrophoneDevice
source: Microphone:
de: Mikrofon:
tr: Mikrofon:

source: Unknown System
de: Unbekanntes System
tr: Bilinmeyen Sistem

# UnknownSystemDescription
source: Unknown System - Universal Compatibility Mode
de: Unbekanntes System - Universeller Kompatibilitätsmodus
tr: Bilinmeyen Sistem - Evrensel Uyumluluk Modu

# RecommendedSettingsDescription
source: Choose any OSD style based on your preference - all styles work universally
de: Wählen Sie einen beliebigen OSD-Stil nach Ihren Vorlieben - alle Stile funktionieren universell
tr: Tercihinize göre herhangi bir OSD stilini seçin - tüm stiller evrensel olarak çalışır

source: Unknown
de: Unbekannt
tr: Bilinmeyen

# SettingsTitle
source: MicControlX Settings
de: MicControlX Einstellungen
tr: MicControlX Ayarları

source: OK
tr: Tamam

source: Cancel
de: Abbrechen
tr: İptal

source: Hotkey Settings
de: Tastenkombination-Einstellungen
tr: Kısayol Ayarları

# GlobalHotkeyLabel
source: Global Hotkey:
de: Globale Tastenkombination:
tr: Genel Kısayol:

source: Notification Type
de: Benachrichtigungstyp
tr: Bildirim Türü

source: Show OSD overlay
de: OSD-Overlay anzeigen
tr: OSD katmanını göster

source: Show tray notifications
de: Infobereich-Benachrichtigungen anzeigen
tr: Tepsi bildirimlerini göster

# OSDStyleLabel
source: OSD Style:
de: OSD-Stil:
tr: OSD Stili:

# OSDDefaultStyle
source: Default Style
de: Standard-Stil
tr: Varsayılan Stil

# OSDVantageStyle
source: Vantage Style
de: Vantage-Stil
tr: Vantage Stili

# OSDLLTStyle
source: Legion Toolkit Style
de: Legion Toolkit-Stil
tr: Legion Toolkit Stili

# OSDTranslucentStyle
source: Translucent Style
de: Durchsichtiger Stil
tr: Şeffaf Stil

# OSDPositionLabel
source: OSD Position:
tr: OSD Konumu:

# OSDTopLeft
source: Top Left
de: Oben Links
tr: Sol Üst

# OSDTopCenter
source: Top Center
de: Oben Mitte
tr: Üst Orta

# OSDTopRight
source: Top Right
de: Oben Rechts
tr: Sağ Üst

# OSDMiddleCenter
source: Middle Center
de: Mitte Zentrum
tr: Orta Merkez

# OSDBottomLeft
source: Bottom Left
de: Unten Links
tr: Sol Alt

# OSDBottomCenter
source: Bottom Center
de: Unten Mitte
tr: Alt Orta

# OSDBottomRight
source: Bottom Right
de: Unten Rechts
tr: Sağ Alt

# OSDDurationLabel
source: OSD Duration:
de: OSD-Dauer:
tr: OSD Süresi:

# LanguageLabel
source: Language:
de: Sprache:
tr: Dil:

# LanguageAuto
source: Auto (System Default)
de: Automatisch (Systemstandard)
tr: Otomatik (Sistem Varsayılanı)

# LanguageEnglish
source: English
de: Englisch
tr: İngilizce

# LanguageGerman
source: Deutsch
tr: Almanca

source: Application Settings
de: Anwendungseinstellungen
tr: Uygulama Ayarları

# ThemeLabel
source: Theme:
de: Design:
tr: Tema:

# ThemeSystem
source: Auto (System Default)
de: Automatisch (Systemstandard)
tr: Otomatik (Sistem Varsayılanı)

# ThemeDark
source: Dark
de: Dunkel
tr: Koyu

# ThemeLight
source: Light
de: Hell
tr: Açık

source: Start with Windows
de: Mit Windows starten
tr: Windows ile Başlat

source: Enable sound feedback
de: Audio-Feedback aktivieren
tr: Sesli geri bildirimi etkinleştir

# RespectFocusAssist
source: Respect Focus Assist (DND)
de: Fokus-Assistent respektieren (DND)
tr: Odaklanma Yardımcısı'nı Dikkate Al (DND)

# AboutTitle
source: About MicControlX
de: Über MicControlX
tr: MicControlX Hakkında

# VersionTemplate
source: Version {0}
tr: Sürüm {0}

source: Version
tr: Sürüm

# AppDescription
source: Global microphone control utility with hotkey support and system tray integration.
de: Globales Mikrofon-Steuerungsprogramm mit Tastenkombination-Unterstützung und Infobereich-Integration.
tr: Kısayol tuş desteği ve sistem çubuğu entegrasyonu ile global mikrofon kontrol programı.

source: Features:
de: Funktionen:
tr: Özellikler:

# FeatureGlobalHotkey
source: • Global hotkey support (F1-F24)
de: • Globale Tastenkombination-Unterstützung (F1-F24)
tr: • Genel kısayol desteği (F1-F24)

# FeatureSystemTray
source: • System tray integration with context menu
de: • Infobereich-Integration mit Kontextmenü
tr: • Bağlam menüsü ile sistem tepsisi entegrasyonu

# FeatureMultipleOSD
source: • Multiple OSD notification styles
de: • Mehrere OSD-Benachrichtigungsstile
tr: • Birden fazla OSD bildirim stili

# FeatureAudioFeedback
source: • Audio feedback with custom sounds
de: • Audio-Feedback mit benutzerdefinierten Tönen
tr: • Özel seslerle sesli geri bildirim

# FeatureHoldHotkey
source: • Hold hotkey to temporarily mute/unmute
de: • Tastenkombination gedrückt halten für vorübergehende Stummschaltung
tr: • Geçici olarak sessize almak/açmak için kısayola basılı tut

# FeatureAutoStartup
source: • Automatic startup and background operation
de: • Automatischer Start und Hintergrundbetrieb
tr: • Otomatik başlatma ve arka planda çalışma

# AboutDescription
source: This application provides quick and reliable microphone control for users who need instant mute/unmute functionality during calls, streaming, or recording sessions without interrupting their workflow.
de: Diese Anwendung bietet schnelle und zuverlässige Mikrofonsteuerung für Benutzer, die sofortige Stummschaltung/Aktivierung während Anrufen, Streams oder Aufnahmen benötigen, ohne ihren Arbeitsablauf zu unterbrechen.
tr: Bu uygulama, kullanıcıların iş akışlarını bölmeden aramalar, yayınlar veya kayıtlar sırasında anında sessize alma/açma işlevine ihtiyaç duyması için hızlı ve güvenilir mikrofon kontrolü sağlar.

# Copyright
source: © 2025 Dr. Skinner - GNU General Public License v3.0
tr: © 2025 Dr. Skinner - GNU Genel Kamu Lisansı v3.0

source: Check for Updates
de: Nach Updates suchen
tr: Güncellemeleri Denetle

source: Checking for updates...
de: Suche nach Updates...
tr: Güncellemeler kontrol ediliyor...

# UpdateAvailableMessage
source: New version {0} available. Download now?
de: Neue Version {0} verfügbar. Jetzt herunterladen?
tr: Yeni sürüm {0} mevcut. Şimdi indir?

source: Downloading update...
de: Update wird heruntergeladen...
tr: Güncelleme indiriliyor...

# DownloadingProgress
source: Downloading... {0}
de: Herunterladen... {0}
tr: İndiriliyor... {0}

# UpdateReadyToRestart
source: Update downloaded. Restart to apply?
de: Update heruntergeladen. Neu starten?
tr: Güncelleme indirildi. Yeniden başlat?

# UpToDate
source: You're up to date!
de: Sie sind auf dem neuesten Stand!
tr: En güncel sürümü kullanıyorsunuz!

source: Download
de: Herunterladen
tr: İndir

# RestartAndUpdate
source: Restart & Update
de: Neustarten & Aktualisieren
tr: Yeniden Başlat & Güncelle

source: Try Again
de: Erneut versuchen
tr: Tekrar Dene

# UpdateFailed
source: Update failed: {0}
de: Update fehlgeschlagen: {0}
tr: Güncelleme başarısız: {0}

source: Update check failed
de: Update-Prüfung fehlgeschlagen
tr: Güncelleme kontrolü başarısız

# UpdateErrorRateLimited
source: Rate limited by GitHub. Please try again in an hour.
de: Von GitHub limitiert. Bitte versuchen Sie es in einer Stunde erneut.
tr: GitHub tarafından sınırlandırıldı. Lütfen bir saat sonra tekrar deneyin.

# UpdateErrorNetworkError
source: No internet connection available
de: Keine Internetverbindung verfügbar
tr: İnternet bağlantısı mevcut değil

# UpdateErrorNotFound
source: Update repository not accessible
de: Update-Repository nicht erreichbar
tr: Güncelleme deposuna erişilemiyor

# UpdateErrorInvalidResponse
source: Invalid response from update server
de: Ungültige Antwort vom Update-Server
tr: Güncelleme sunucusundan geçersiz yanıt

source: Download failed
de: Download fehlgeschlagen: {0}
tr: İndirme başarısız: {0}

source: Download cancelled by user
de: Download vom Benutzer abgebrochen
tr: İndirme kullanıcı tarafından iptal edildi

# DownloadErrorTimeout
source: Connection timeout
de: Verbindungs-Timeout
tr: Bağlantı zaman aşımı

# DownloadErrorNetwork
source: Network connection error
de: Netzwerkverbindungsfehler
tr: Ağ bağlantı hatası

source: Toggle Microphone
de: Mikrofon umschalten
tr: Mikrofonu Aç/Kapat

source: Exit
de: Beenden
tr: Çıkış

# TrayTooltipMuted
source: MicControlX - Muted
de: MicControlX - Stumm
tr: MicControlX - Sessiz

# TrayTooltipActive
source: MicControlX - Active
de: MicControlX - Aktiv
tr: MicControlX - Aktif

source: Microphone Muted
de: Mikrofon stumm
tr: Mikrofon Sessizde

source: Microphone Active
de: Mikrofon aktiv
tr: Mikrofon Aktif

# NotificationMicrophoneMuted
source: Microphone Muted
de: Mikrofon stumm
tr: Mikrofon Sessizde

# NotificationMicrophoneActive
source: Microphone Active
de: Mikrofon aktiv
tr: Mikrofon Aktif

# NotificationMicrophoneTemporarilyMuted
source: Microphone Temporarily Muted
de: Mikrofon temporär stumm
tr: Mikrofon Geçici Olarak Sessizde

# NotificationMicrophoneTemporarilyActive
source: Microphone Temporarily Active
de: Mikrofon temporär aktiv
tr: Mikrofon Geçici Olarak Aktif

# NoActiveMicrophones
source: No active microphones found
de: Keine aktiven Mikrofone gefunden
tr: Etkin mikrofon bulunamadı

source: NAudio Error
de: NAudio Fehler
tr: NAudio Hatası

source: State Check Error
de: Statusprüfungsfehler
tr: Durum Denetim Hatası

# ErrorTitle
source: Error
de: Fehler
tr: Hata

# AppAlreadyRunning
source: MicControlX is already running. Check the system tray.
de: MicControlX läuft bereits. Überprüfen Sie die Taskleiste.
tr: MicControlX zaten çalışıyor. Sistem tepsisini kontrol edin.

# ErrorStartupTitle
source: Startup Error
de: Startfehler
tr: Başlatma Hatası

source: Startup Error
de: Startfehler
tr: Başlatma Hatası

# ErrorInitializationMessage
source: Initialization error: {0} Stack trace: {1}
de: Initialisierungsfehler: {0} Stack-Trace: {1}
tr: Başlatma hatası: {0} Yığın izleme: {1}

# ErrorStartupSettingTitle
source: Startup Setting Failed
de: Autostart-Einstellung fehlgeschlagen
tr: Başlatma Ayarı Başarısız

# ErrorStartupSettingMessage
source: Warning: Failed to {0} Windows startup setting. Error: {1} This may be due to: • Insufficient registry permissions • Antivirus software blocking registry changes • Group policy restrictions Your other settings have been saved successfully.
de: Warnung: {0} der Windows-Autostart-Einstellung fehlgeschlagen. Fehler: {1} Dies kann verursacht werden durch: • Unzureichende Registry-Berechtigungen • Antivirus-Software blockiert Registry-Änderungen • Gruppenrichtlinien-Beschränkungen Ihre anderen Einstellungen wurden erfolgreich gespeichert.
tr: Uyarı: Windows başlangıç ayarını {0} işlemi başarısız oldu. Hata: {1} Bunun nedeni olabilir: • Yetersiz kayıt defteri izinleri • Kayıt defteri değişikliklerini engelleyen antivirüs yazılımı • Grup ilkesi kısıtlamaları Diğer ayarlarınız başarıyla kaydedildi.

# ErrorSettingsTitle
source: Settings Error
de: Einstellungsfehler
tr: Ayar Hatası

# ErrorSettingsInitMessage
source: SettingsWindow initialization error: {0} Stack trace: {1}
de: Initialisierungsfehler des Einstellungsfensters: {0} Stack-Trace: {1}
tr: AyarlarPenceresi başlatma hatası: {0} Yığın izi: {1}

# ErrorLoadSettingsMessage
source: LoadCurrentSettings error: {0}
de: LoadCurrentSettings Fehler: {0}
tr: LoadCurrentSettings hatası: {0}

# SettingsErrorMessage
source: Settings error: {0}
de: Einstellungsfehler: {0}
tr: Ayar hatası: {0}

# ErrorConfigSaveTitle
source: Configuration Save Error
de: Konfiguration speichern fehlgeschlagen
tr: Yapılandırma Kaydetme Hatası

# ErrorConfigSaveMessage
source: Failed to save configuration settings. Error: {0} This may be caused by: • Insufficient permissions to write to AppData folder • Disk space issues • Antivirus software blocking file access Your settings could not be saved.
de: Konfigurationseinstellungen konnten nicht gespeichert werden. Fehler: {0} Dies kann verursacht werden durch: • Unzureichende Berechtigungen zum Schreiben in AppData-Ordner • Festplattenspeicher-Probleme • Antivirus-Software blockiert Dateizugriff Ihre Einstellungen konnten nicht gespeichert werden.
tr: Yapılandırma ayarları kaydedilemedi. Hata: {0} Bunun nedeni olabilir: • AppData klasörüne yazmak için yetersiz izin • Disk alanı sorunları • Dosya erişimini engelleyen antivirüs yazılımı Ayarlarınız kaydedilemedi.

# ErrorHotkeyRegistrationTitle
source: Hotkey Registration Failed
de: Tastenkombination-Registrierung fehlgeschlagen
tr: Kısayol Kaydı Başarısız

# ErrorHotkeyRegistrationMessage
source: The {0} hotkey could not be registered. Possible reasons: • Another application is already using this key • System-level restrictions • Function key conflicts You can: • Change the hotkey in Settings • Use the system tray icon to toggle the microphone • Close applications that might be using {0}
de: Die {0} Tastenkombination konnte nicht registriert werden. Mögliche Ursachen: • Eine andere Anwendung verwendet bereits diese Taste • System-Einschränkungen • Funktionstasten-Konflikte Sie können: • Die Tastenkombination in den Einstellungen ändern • Das Infobereich-Symbol verwenden um das Mikrofon umzuschalten • Anwendungen schließen, die möglicherweise {0} verwenden
tr: {0} kısayolu kaydedilemedi. Olası nedenler: • Başka bir uygulama bu tuşu zaten kullanıyor • Sistem düzeyinde kısıtlamalar • Fonksiyon tuşu çakışmaları Yapabilecekleriniz: • Ayarlardan kısayolu değiştirin • Mikrofonu aç/kapat için sistem tepsisi simgesini kullanın • {0} tuşunu kullanıyor olabilecek uygulamaları kapatın

# ErrorHotkeyConflictMessage
source: Failed to register the new {0} hotkey. Reason: {1} Suggested alternatives: {2} The hotkey setting has been saved, but won't work until you: • Choose a different hotkey in Settings • Close other applications that might be using {0} • Restart MicControlX
de: Die neue {0} Tastenkombination konnte nicht registriert werden. Ursache: {1} Vorgeschlagene Alternativen: {2} Die Tastenkombination-Einstellung wurde gespeichert, funktioniert aber erst wenn Sie: • Eine andere Tastenkombination in den Einstellungen wählen • Andere Anwendungen schließen, die möglicherweise {0} verwenden • MicControlX neustarten
tr: Yeni {0} kısayolu kaydedilemedi. Neden: {1} Önerilen alternatifler: {2} Kısayol ayarı kaydedildi, ancak şunları yapana kadar çalışmayacak: • Ayarlardan farklı bir kısayol seçin • {0} tuşunu kullanıyor olabilecek diğer uygulamaları kapatın • MicControlX’i yeniden başlatın

# ErrorAboutWindow
source: Error creating About window: {0} Stack trace: {1}
de: Fehler beim Erstellen des Über-Fensters: {0} Stack-Trace: {1}
tr: Hakkında penceresi oluşturulurken hata: {0} Yığın izi: {1}

# OSDInitializationWarningTitle
source: OSD Initialization Warning
de: OSD-Initialisierungswarnung
tr: OSD Başlatma Uyarısı

# OSDInitializationWarningMessage
source: Warning: Visual overlay (OSD) initialization failed. Error: {0} The application will work normally, but you won't see visual feedback when toggling the microphone. You can try: • Changing the OSD style in Settings • Disabling OSD in Settings if the problem persists
de: Warnung: Initialisierung des visuellen Overlays (OSD) fehlgeschlagen. Fehler: {0} Die Anwendung wird normal funktionieren, aber Sie sehen keine visuelle Rückmeldung beim Umschalten des Mikrofons. Sie können versuchen: • Den OSD-Stil in den Einstellungen zu ändern • OSD in den Einstellungen zu deaktivieren, falls das Problem weiterhin besteht
tr: Uyarı: Görsel katman (OSD) başlatma başarısız. Hata: {0} Uygulama normal çalışacak, ancak mikrofonu açıp kapatırken görsel geri bildirim göremeyeceksiniz. Şunları deneyebilirsiniz: • Ayarlardan OSD stilini değiştirmek • Sorun devam ederse OSD’yi devre dışı bırakmak

# ActionEnable
source: enable
de: aktivieren
tr: etkinleştir

# ActionDisable
source: disable
de: deaktivieren
tr: devre dışı bırak

source: Platform:
de: Plattform:

# LanguageTurkish
source: Türkçe
de: Türkisch
